Revit 2026 API

# TopographySurfaceAsSiteSubRegion Method

---

Obtains the subregion object represented by this element.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SiteSubRegion AsSiteSubRegion()
```
```vb
Public Function AsSiteSubRegion As SiteSubRegion
```
```cpp
public:
SiteSubRegion^ AsSiteSubRegion()
```
```fsharp
member AsSiteSubRegion : unit -> SiteSubRegion
```

#### Return Value

SiteSubRegion The SiteSubRegion element. If this does not represent a SiteSubRegion, this will be .

This applies to TopographySurface and SiteSubRegion elements.

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace